import { Language } from '../i18n/translations';

export const regionLabels: Record<string, Record<Language, string>> = {
    "Abai": { ru: "область Абай", kk: "Абай облысы" },
    "Akmola": { ru: "Акмолинская область", kk: "Ақмола облысы" },
    "Aktobe": { ru: "Актюбинская область", kk: "Ақтөбе облысы" },
    "Almaty": { ru: "Алматинская область", kk: "Алматы облысы" },
    "Atyrau": { ru: "Атырауская область", kk: "Атырау облысы" },
    "Jambyl": { ru: "Жамбылская область", kk: "Жамбыл облысы" },
    "Jetisu": { ru: "область Жетісу", kk: "Жетісу облысы" },
    "West Kazakhstan": { ru: "Западно-Казахстанская область", kk: "Батыс Қазақстан облысы" },
    "Karaganda": { ru: "Карагандинская область", kk: "Қарағанды облысы" },
    "Kostanay": { ru: "Костанайская область", kk: "Қостанай облысы" },
    "Kyzylorda": { ru: "Кызылординская область", kk: "Қызылорда облысы" },
    "Mangystau": { ru: "Мангистауская область", kk: "Маңғыстау облысы" },
    "Pavlodar": { ru: "Павлодарская область", kk: "Павлодар облысы" },
    "North Kazakhstan": { ru: "Северо-Казахстанская область", kk: "Солтүстік Қазақстан облысы" },
    "Turkestan": { ru: "Туркестанская область", kk: "Түркістан облысы" },
    "Ulytau": { ru: "область Ұлытау", kk: "Ұлытау облысы" },
    "East Kazakhstan": { ru: "Восточно-Казахстанская область", kk: "Шығыс Қазақстан облысы" },
    "Astana": { ru: "г.Астана", kk: "Астана қ." },
    "Almaty (city)": { ru: "г.Алматы", kk: "Алматы қ." },
    "Shymkent (city)": { ru: "г.Шымкент", kk: "Шымкент қ." }
};
